{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "C:\\Users\\Yuiki\\.cache\\huggingface\\hub\\models--meta-llama--Llama-3.1-8b\\snapshots\\d04e592bb4f6aa9cfee91e2e20afa771667e1d4b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "down_proj",
    "gate_proj",
    "o_proj",
    "up_proj",
    "v_proj",
    "q_proj",
    "k_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}